app/controllers/accounts_controller.rb

SELECT * FROM "accounts" WHERE ("accounts".user_id = 1) LIMIT 1
---
  def index
    #@accounts = Account.paginate :per_page => 10, :page => params[:page], :order => 'updated_at DESC'
    @accounts = Account.all

SELECT * FROM "accounts" WHERE ("accounts".user_id = 1) LIMIT 1
SELECT * FROM "activities" WHERE ("activities".house_id = 1)
SELECT sum("activities".cost) AS sum_cost FROM "activities" WHERE (house_id = 1 and created_at > '2009-11-01')
SELECT "houses".* FROM "houses" INNER JOIN "house_sharings" ON "houses".id = "house_sharings".house_id WHERE (("house_sharings".user_id = 1))
SELECT "users".* FROM "users" INNER JOIN "house_sharings" ON "users".id = "house_sharings".user_id WHERE (("house_sharings".house_id = 1))
---
  def show
    @account = Account.find(params[:id])

    if @account != nil
      if current_user.account.id != @account.id
       flash[:notice] = 'Non è il tuo account'
       redirect_to home_path
      else
        @inizio_mese = 1.month.ago
        @houses = @account.user.houses

        @spesa_personale = Activity.sum :cost,  :conditions => ["user_id = " + current_user.id.to_s + " and created_at > ?", @inizio_mese]
        @spesa_case = 0.0

        @houses.each do |hhh|

SELECT * FROM "accounts" WHERE ("accounts".user_id = 1) LIMIT 1
---
  def edit
    @account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 13)
DELETE FROM "accounts" WHERE "id" = 13
---
  def destroy
    @account = Account.find(params[:id])
    @account.destroy

SELECT * FROM "accounts" WHERE ("accounts"."id" = 5)
---
  def start_app
     @account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 5)
---
   def stop_app
     @account = Account.find(params[:id])