app/controllers/activities_controller.rb

  def index
    @page = 'activities'

    #@activities = Activity.paginate( :per_page => 10,
    #:page => params[:page],
    #:order => 'updated_at DESC',
    #:conditions => ["user_id == ?", current_user.id]
    #)
    @activities = Activity.find_all_by_user_id(current_user.id)

    if @activities.length == 0
---
SELECT * FROM "activities" WHERE ("activities"."user_id" = 1) LIMIT 1
SELECT count(*) AS count_all FROM "activities" WHERE (user_id == 1)

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def new
    @activity = Activity.new
    @user = current_user
    @expiration =  Time.now

    @houses = @user.houses
    if @houses.length == 0
---
SELECT "houses".* FROM "houses" INNER JOIN "house_sharings" ON "houses".id = "house_sharings".house_id WHERE (("house_sharings".user_id = 1))

  def new_for_user
    @activity = Activity.new
    @user = User.find(params[:user][:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 3)

  def create_for_user
     debugger
     @activity = Activity.new
     @house = House.find(params[:house_id])
     @activity.name = params[:name]
     @activity.duration = params[:duration]
     @activity.house_id = @house.id
     @activity.cost = params[:cost]
     @activity.description = params[:description]
     @activity.expiration = Date.civil(params[:date_expiration][:"expiration(1i)"].to_i,params[:date_expiration][:"expiration(2i)"].to_i,params[:date_expiration][:"expiration(3i)"].to_i)
     @activity.user_id = params[:user_id]
     @activity.done = 0

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("name", "duration", "created_at", "cost", "updated_at", "expiration", "done", "user_id", "house_id", "description") VALUES('Affitto arretrato', 0.0, '2009-11-22 21:25:26', 125.0, '2009-11-22 21:25:26', '2009-11-29 23:00:00', 0, 6, 1, 'affitto arretrato')

  def create
    @activity = Activity.new

     @activity.name = params[:name]
     @activity.duration = params[:duration]
     @activity.house_id = params[:selected_house]
     @activity.cost = params[:cost]
     @activity.description = params[:description]
     @activity.expiration = Date.civil(params[:date_expiration][:"expiration(1i)"].to_i,params[:date_expiration][:"expiration(2i)"].to_i,params[:date_expiration][:"expiration(3i)"].to_i)

     @activity.user_id = current_user.id
     @activity.done = 0


    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("name", "duration", "created_at", "cost", "updated_at", "expiration", "done", "user_id", "house_id", "description") VALUES('Arretrato affitto', 0.0, '2009-11-22 21:01:56', 125.0, '2009-11-22 21:01:56', '2009-11-29 23:00:00', 0, 4, NULL, 'Affitto arretrato per calcolo errato')

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 3)
UPDATE "activities" SET "duration" = 0.0, "cost" = 0.0, "expiration" = '2009-11-20 10:33:00', "description" = 'prova data', "updated_at" = '2009-11-20 10:33:23' WHERE "id" = 3

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM "activities" WHERE ("activities"."id" = 8)
DELETE FROM "activities" WHERE "id" = 8