app/controllers/home_controller.rb

  def invia_comunicazione
    body = params[:body]

   if logged_in?
     from = current_user.login
	 else
		 from = 'unknown'
    end

    @destination = User.find_by_login('Admin')
---
SELECT * FROM "users" WHERE ("users"."login" = 'Admin') LIMIT 1