app/controllers/houses_controller.rb

SELECT "houses".* FROM "houses" INNER JOIN "house_sharings" ON "houses".id = "house_sharings".house_id WHERE (("house_sharings".user_id = 1))
---
  def index
    #@houses  = House.paginate( :per_page => 10,
    # :page => params[:page],
    # :order => 'updated_at DESC',
    # :conditions => ["creator_id == ?", current_user.id]
    # )

    @houses = current_user.houses

    if @houses.length == 0

SELECT * FROM "house_sharings" WHERE (house_id == 1) AND ("house_sharings"."user_id" = 1) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "house_sharings" ("created_at", "updated_at", "user_id", "house_id", "active") VALUES('2009-11-20 19:03:48', '2009-11-20 19:03:48', 1, 1, 1)
---
  def partecipa
    debugger
    @house = House.find(params[:id])
    @share = HouseSharing.find_by_user_id(current_user.id, :conditions => ["house_id == ?", @house.id])

    if @share.nil?
       @hs = HouseSharing.new
       @hs.user_id = current_user.id
       @hs.house_id = @house.id
       @hs.active = 1
       @hs.save

SELECT * FROM "house_sharings" WHERE (house_id == 3) AND ("house_sharings"."user_id" = 1) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "house_sharings" WHERE "id" = 3
SELECT * FROM "activities" WHERE ("activities"."user_id" = 1)
---
  def esci_da_casa
      @house = House.find(params[:id])
      @share = HouseSharing.find_by_user_id(current_user.id, :conditions => ["house_id == ?", @house.id])

      if @share.nil?
          flash[:notice] = 'Non sei inquilino di questa casa'
      else
         @share.destroy
         @share.save

         activities = Activity.find_all_by_user_id(current_user.id)

SELECT "users".* FROM "users" INNER JOIN "house_sharings" ON "users".id = "house_sharings".user_id WHERE (("house_sharings".house_id = 1))
---
  def invia_notifica
     debugger
      body = params[:body]
      from = current_user.login

  	  @house = House.find(params[:id])
      variabili_spesa(@house)

      begin
         @house.users.each do |us|

INSERT INTO "houses" ("name", "place", "updated_at", "creator_id", "created_at") VALUES('Grande Giove', '', '2009-11-20 09:31:54', 1, '2009-11-20 09:31:54')
INSERT INTO "house_sharings" ("updated_at", "house_id", "user_id", "active", "created_at") VALUES('2009-11-20 09:31:54', NULL, 1, 1, '2009-11-20 09:31:54')
---
  def create
    @house = House.new(params[:house])

    @house.creator_id = current_user.id

    respond_to do |format|
      if @house.save

        @house_sharing = HouseSharing.new
        @house_sharing.house_id = @house.id
        @house_sharing.user_id = current_user.id
        @house_sharing.active = 1
        @house_sharing.save

SELECT "users".* FROM "users" INNER JOIN "house_sharings" ON "users".id = "house_sharings".user_id WHERE (("house_sharings".house_id = 3))
---
  def destroy
    @house = House.find(params[:id])
    if @house.users.length == 0