app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "activated_at", "crypted_password", "deleted_at", "remember_token_expires_at", "is_admin", "activation_code", "password_reset_code", "remember_token", "login", "email", "created_at", "state") VALUES('5c5845b46b50c12442836ad5268033d6e7ff7419', '2009-11-17 13:57:32', NULL, 'aa53a5c3c616788d0428a187c1797023005555c0', NULL, NULL, 0, 'b1c071d3fa349ce63a2bfac7878866ad2777199a', NULL, NULL, 'Admin', 'danielesabetta@gmail.com', '2009-11-17 13:57:32', 'pending')
SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = 'danielesabetta@gmail.com' AND "users".id <> 1) LIMIT 1
INSERT INTO "accounts" ("name", "money", "updated_at", "notes", "user_id", "surname", "created_at") VALUES(NULL, 0.0, '2009-11-17 13:57:31', NULL, NULL, NULL, '2009-11-17 13:57:31')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    reset_session

    debugger
    @user = User.new
    @user.email = params[:user][:email]
    @user.login = params[:user][:login]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    @user.is_admin = 0 #non amministratore

    @account = Account.new(params[:user][:account_attributes])
    @account.money = 0

    @user.register! if @user.valid?

    begin
      @user.save

      if @user.errors.empty?
          @account.user_id = @user.id
          @account.save

DELETE FROM "users" WHERE "id" = 2
---
          render :action => 'new'
      end
    rescue
      @user.destroy

SELECT * FROM "users"
---
    def index
    #@users = User.paginate :per_page => 10, :page => params[:page]
   @users = User.all

SELECT * FROM "users" WHERE ("users"."activation_code" = '7087743c2ddfac1285dfdea77b0f7bb9e1b239e8') LIMIT 1
---
   def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def find_user
    @user = User.find(params[:id])